# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит натуральное
# число N – количество элементов в массиве. В последующих строках записаны N
# целых чисел Ai. Последняя строка содержит число X
#
# пример
# 5
# 1 2 3 4 5
# 3
# -> 1

# n = int(input('Введите натуральное число: '))
# list_1 = []
# for i in range(1, n + 1):
#     m = int(input('Введите значение для массива: '))
#     list_1.append(m)
# print(list_1)
# x = int(input('Введите искомое число: '))
# count = 0
# for i in range(1, len(list_1)):
#     if x == list_1[i]:
#         count += 1
# print(count)


# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине
# элемент к заданному числу X. Пользователь в первой строке вводит натуральное
# число N – количество элементов в массиве. В последующих строках записаны N
# целых чисел Ai. Последняя строка содержит число X
#
# пример
# 5
# 1 2 3 4 5
# 6
# -> 5

# n = int(input('Введите натуральное число: '))
# list_1 = []
# for i in range(1, n + 1):
#     m = int(input('Введите значение для массива: '))
#     list_1.append(m)
# print(list_1)
# x = int(input('Введите искомое число: '))
# temp = float
# min_diff = n
# nearest_value = int
# for y in range(1, len(list_1)):
#     temp = abs(list_1[y] - x)
#     if min_diff > temp:
#         min_diff = temp
#         nearest_value = list_1[y]
# print(nearest_value)

